#### ConnectionInputPointInfo Members

---

|  |
| --- |
| ConnectionInputPointInfo Class   Constructors   Methods   Properties   See Also |

The  ConnectionInputPointInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionInputPointInfo | Construct a default input point. |
| Public method | ConnectionInputPointInfo(String, Int32, String) | Construct an input point info. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectionInputPointInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | InputMemberIndex | A index of the input member to which the restriction applies. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PointSelectionText | A string used to select input point by some connections. |
| Public property | RestrictionType | A type of input point restriction. |

# See Also

ConnectionInputPointInfo Class

Autodesk.Revit.DB.Structure Namespace